RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/inc/at32f45x_can.h
/**
  **************************************************************************
  * @file     at32f45x_can.h
  * @brief    at32f45x can header file
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

/* define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F45x_CAN_H
#define __AT32F45x_CAN_H

#ifdef __cplusplus
extern "C" {
#endif

/* includes ------------------------------------------------------------------*/
#include "at32f45x.h"

/* AT32F456xx and AT32F457xx support can-fd */
#if defined (AT32F456xx) || defined (AT32F457xx)
#define SUPPORT_CAN_FD
#endif

/** @addtogroup AT32F45x_periph_driver
  * @{
  */

/** @addtogroup CAN
  * @{
  */

/** @defgroup CAN_interrupts_definition
  * @brief can interrupt
  * @{
  */

#define CAN_AIE_INT                      ((uint32_t)0x00000001) /*!< abort interrupt */
#define CAN_EIE_INT                      ((uint32_t)0x00000002) /*!< error interrupt */
#define CAN_TSIE_INT                     ((uint32_t)0x00000004) /*!< transmission of the secondary transmit buffer completed interrupt */
#define CAN_TPIE_INT                     ((uint32_t)0x00000008) /*!< transmission of the primary transmit buffer completed interrupt */
#define CAN_RAFIE_INT                    ((uint32_t)0x00000010) /*!< rxbuf almost full interrupt */
#define CAN_RFIE_INT                     ((uint32_t)0x00000020) /*!< rxbuf full interrupt */
#define CAN_ROIE_INT                     ((uint32_t)0x00000040) /*!< rxbuf overflow interrupt */
#define CAN_RIE_INT                      ((uint32_t)0x00000080) /*!< receiver interrupt */
#define CAN_BEIE_INT                     ((uint32_t)0x00000100) /*!< bus error interrupt */
#define CAN_ALIE_INT                     ((uint32_t)0x00000200) /*!< arbitration lost interrupt */
#define CAN_EPIE_INT                     ((uint32_t)0x00000400) /*!< error passive interrupt */
#define CAN_TTIE_INT                     ((uint32_t)0x00000800) /*!< time trigger interrupt */
#define CAN_TEIE_INT                     ((uint32_t)0x00001000) /*!< trigger error interrupt */
#define CAN_WTIE_INT                     ((uint32_t)0x00002000) /*!< watch trigger interrupt */
#define CAN_ALL_INT                      ((uint32_t)0xFFFFFFFF) /*!< all interrupt */

/**
  * @}
  */

/** @defgroup CAN_flags_definition
  * @brief can flag
  * @{
  */

#define CAN_AIF_FLAG                     ((uint32_t)0x00000001) /*!< abort interrupt flag */
#define CAN_EIF_FLAG                     ((uint32_t)0x00000002) /*!< error interrupt flag: error warning or busoff. */
#define CAN_TSIF_FLAG                    ((uint32_t)0x00000004) /*!< transmission of the secondary transmit buffer be completed interrupt flag */
#define CAN_TPIF_FLAG                    ((uint32_t)0x00000008) /*!< transmission of the primary transmit buffer be completed interrupt flag */
#define CAN_RAFIF_FLAG                   ((uint32_t)0x00000010) /*!< rxbuf almost full interrupt flag */
#define CAN_RFIF_FLAG                    ((uint32_t)0x00000020) /*!< rxbuf full interrupt flag */
#define CAN_ROIF_FLAG                    ((uint32_t)0x00000040) /*!< rxbuf overflow interrupt flag */
#define CAN_RIF_FLAG                     ((uint32_t)0x00000080) /*!< receiver interrupt flag */
#define CAN_BEIF_FLAG                    ((uint32_t)0x00000100) /*!< bus error interrupt flag */
#define CAN_ALIF_FLAG                    ((uint32_t)0x00000200) /*!< arbitration lost interrupt flag */
#define CAN_EPIF_FLAG                    ((uint32_t)0x00000400) /*!< error passive interrupt flag */
#define CAN_TTIF_FLAG                    ((uint32_t)0x00000800) /*!< time trigger interrupt flag */
#define CAN_TEIF_FLAG                    ((uint32_t)0x00001000) /*!< trigger error interrupt flag */
#define CAN_WTIF_FLAG                    ((uint32_t)0x00002000) /*!< watch trigger interrupt flag */
#define CAN_EPASS_FLAG                   ((uint32_t)0x40000000) /*!< error passive status flag */
#define CAN_EWARN_FLAG                   ((uint32_t)0x80000000) /*!< error warning limit reached status flag */
#define CAN_ALL_FLAG                     ((uint32_t)0xFFFFFFFF) /*!< all interrupt and status flag */

/**
  * @}
  */

/**
  * @brief  can identifier type
  */
typedef enum
{
  CAN_ID_STANDARD                        = 0x00, /*!< standard Id */
  CAN_ID_EXTENDED                        = 0x01  /*!< extended Id */
} can_identifier_type;

/**
  * @brief  can frame type
  */
typedef enum
{
  CAN_FRAME_DATA                         = 0x00, /*!< data frame */
  CAN_FRAME_REMOTE                       = 0x01  /*!< remote frame */
} can_frame_type;

#ifdef SUPPORT_CAN_FD
/**
  * @brief  can format type
  */
typedef enum
{
  CAN_FORMAT_CLASSIC                     = 0x00, /*!< CLASSIC-CAN format */
  CAN_FORMAT_FD                          = 0x01  /*!< FD-CAN format */
} can_format_type;

/**
  * @brief  can bitrate switch type
  */
typedef enum
{
  CAN_BRS_OFF                            = 0x00, /*!< bit rate switch off */
  CAN_BRS_ON                             = 0x01  /*!< bit rate switch on */
} can_rate_switch_type;

/**
  * @brief  can error state indicator type
  */
typedef enum
{
  CAN_ESI_ACTIVE                         = 0x00, /*!< error_state_indicator active */
  CAN_ESI_PASSIVE                        = 0x01  /*!< error_state_indicator passive */
} can_error_state_type;
#endif

/**
  * @brief  can data length type
  */
typedef enum
{
  CAN_DLC_BYTES_0                        = 0x00, /*!< 0 bytes data field */
  CAN_DLC_BYTES_1                        = 0x01, /*!< 1 bytes data field */
  CAN_DLC_BYTES_2                        = 0x02, /*!< 2 bytes data field */
  CAN_DLC_BYTES_3                        = 0x03, /*!< 3 bytes data field */
  CAN_DLC_BYTES_4                        = 0x04, /*!< 4 bytes data field */
  CAN_DLC_BYTES_5                        = 0x05, /*!< 5 bytes data field */
  CAN_DLC_BYTES_6                        = 0x06, /*!< 6 bytes data field */
  CAN_DLC_BYTES_7                        = 0x07, /*!< 7 bytes data field */
  CAN_DLC_BYTES_8                        = 0x08, /*!< 8 bytes data field */
#ifdef SUPPORT_CAN_FD
  CAN_DLC_BYTES_12                       = 0x09, /*!< 12 bytes data field */
  CAN_DLC_BYTES_16                       = 0x0A, /*!< 16 bytes data field */
  CAN_DLC_BYTES_20                       = 0x0B, /*!< 20 bytes data field */
  CAN_DLC_BYTES_24                       = 0x0C, /*!< 24 bytes data field */
  CAN_DLC_BYTES_32                       = 0x0D, /*!< 32 bytes data field */
  CAN_DLC_BYTES_48                       = 0x0E, /*!< 48 bytes data field */
  CAN_DLC_BYTES_64                       = 0x0F  /*!< 64 bytes data field */
#endif
} can_data_length_type;

/**
  * @brief  can txbuf select type
  */
typedef enum
{
  CAN_TXBUF_PTB                          = 0x00, /*!< the primary transmit buffer (high priority) */
  CAN_TXBUF_STB                          = 0x01  /*!< the secondary transmit buffer (low priority) */
} can_txbuf_select_type;

/**
  * @brief  can txbuf transmit type
  */
typedef enum
{
  CAN_TRANSMIT_PTB                       = 0x10, /*!< transmit the primary transmit buffer */
  CAN_TRANSMIT_STB_ONE                   = 0x04, /*!< transmit one frame of the secondary transmit buffer */
  CAN_TRANSMIT_STB_ALL                   = 0x02  /*!< transmit all frames of the secondary transmit buffer */
} can_txbuf_transmit_type;

/**
  * @brief  can abort transmit type
  */
typedef enum
{
  CAN_ABORT_TRANSMIT_PTB                 = 0x08, /*!< abort transmit of the primary transmit buffer */
  CAN_ABORT_TRANSMIT_STB                 = 0x01  /*!< abort transmit of the secondary transmit buffer */
} can_abort_transmit_type;

/**
  * @brief  can clear the secondary transmit buffer type
  */
typedef enum
{
  CAN_CLEAR_STB_ONE                      = 0x05, /*!< clear one frame of the secondary transmit buffer */
  CAN_CLEAR_STB_ALL                      = 0x03  /*!< clear all frames of the secondary transmit buffer */
} can_clear_stb_type;

/**
  * @brief  can the secondary transmit buffer transmit mode type
  */
typedef enum
{
  CAN_STB_TRANSMIT_BY_FIFO               = 0x00, /*!< the secondary transmit buffer transmit by fifo */
  CAN_STB_TRANSMIT_BY_ID                 = 0x01  /*!< the secondary transmit buffer transmit by id */
} can_stb_transmit_mode_type;

/**
  * @brief  can the secondary transmit buffer status type
  */
typedef enum
{
  CAN_STB_STATUS_EMPTY                   = 0x00, /*!< the secondary transmit buffer(0) is empty */
  CAN_STB_STATUS_LESS                    = 0x01, /*!< the secondary transmit buffer(1) is less than or equal to half full */
  CAN_STB_STATUS_MORE                    = 0x02, /*!< the secondary transmit buffer(2) is more than half full */
  CAN_STB_STATUS_FULL                    = 0x03  /*!< the secondary transmit buffer(3) is full */
} can_stb_status_type;

/**
  * @brief  can rxbuf status type
  */
typedef enum
{
  CAN_RXBUF_STATUS_EMPTY                 = 0x00, /*!< rxbuf: empty */
  CAN_RXBUF_STATUS_LESS                  = 0x01, /*!< rxbuf: > empty and < almost full(AFWL) */
  CAN_RXBUF_STATUS_ALMOST                = 0x02, /*!< rxbuf: >= almost full (programmable threshold by AFWL) but not full and no overflow */
  CAN_RXBUF_STATUS_FULL                  = 0x03, /*!< rxbuf: full */
  CAN_RXBUF_STATUS_OVERFLOW              = 0x04  /*!< rxbuf: overflow */
} can_rxbuf_status_type;

/**
  * @brief  can rxbuf overflow mode type
  */
typedef enum
{
  CAN_RXBUF_OVERFLOW_BE_OVWR             = 0x00, /*!< the oldest frame will be overwritten. */
  CAN_RXBUF_OVERFLOW_BE_LOSE             = 0x01  /*!< the new frame will not be stored. */
} can_rxbuf_overflow_mode_type;

/**
  * @brief  can timestamp position type
  */
typedef enum
{
  CAN_TIMESTAMP_AT_SOF                   = 0x00, /*!< time stamping position at sof */
  CAN_TIMESTAMP_AT_EOF                   = 0x01  /*!< time stamping position at eof */
} can_timestamp_position_type;

/**
  * @brief  can error state indicator type
  */
typedef enum
{
  CAN_KOER_NOERR                         = 0x00, /*!< kind_of_error: no error */
  CAN_KOER_BIT                           = 0x01, /*!< kind_of_error: bit error */
  CAN_KOER_FORM                          = 0x02, /*!< kind_of_error: form error */
  CAN_KOER_STUFF                         = 0x03, /*!< kind_of_error: stuff error */
  CAN_KOER_ACK                           = 0x04, /*!< kind_of_error: ack error */
  CAN_KOER_CRC                           = 0x05, /*!< kind_of_error: crc error */
  CAN_KOER_OTHER                         = 0x06, /*!< kind_of_error: other error */
  CAN_KOER_PCRC                          = 0x07  /*!< kind_of_error: pcrc error (can-xl only) */
} can_error_type;

/**
  * @brief  can receive frame type
  */
typedef enum
{
  CAN_RECV_NORMAL                        = 0x00, /*!< receive normal frame */
  CAN_RECV_LOOPBACK                      = 0x01  /*!< receive loop back frame */
} can_recv_frame_type;

/**
  * @brief  can time_trigger_can timer_div type
  */
typedef enum
{
  CAN_TTCAN_TIMER_DIV_1                  = 0x00, /*!< classic-can bit time div1 to ttcan timer */
  CAN_TTCAN_TIMER_DIV_2                  = 0x01, /*!< classic-can bit time div2 to ttcan timer */
  CAN_TTCAN_TIMER_DIV_4                  = 0x02, /*!< classic-can bit time div4 to ttcan timer */
  CAN_TTCAN_TIMER_DIV_8                  = 0x03, /*!< classic-can bit time div8 to ttcan timer */
} can_ttcan_timer_div_type;

/**
  * @brief  can time_trigger_can trigger type
  */
typedef enum
{
  CAN_TTCAN_TRIGGER_IMMEDIATE            = 0x00, /*!< immediate trigger for immediate transmission */
  CAN_TTCAN_TRIGGER_TIME                 = 0x01, /*!< time trigger for receive triggers */
  CAN_TTCAN_TRIGGER_SINGLE_TRANSMIT      = 0x02, /*!< single shot transmit trigger for exclusive time windows */
  CAN_TTCAN_TRIGGER_TRANSMIT_START       = 0x03, /*!< transmit start trigger for merged arbitrating time windows */
  CAN_TTCAN_TRIGGER_TRANSMIT_STOP        = 0x04, /*!< transmit stop trigger for merged arbitrating time windows */
} can_ttcan_trigger_type;

/**
  * @brief  can ttcan txbuf slot status type
  */
typedef enum
{
  CAN_TTCAN_TXBUF_EMPTY                  = 0x00, /*!< set ttcan txbuf slot to "empty" */
  CAN_TTCAN_TXBUF_FILLED                 = 0x01, /*!< set ttcan txbuf slot to "filled" */
} can_ttcan_txbuf_status_type;

/**
  * @brief  can re-transmission times type
  */
typedef enum
{
  CAN_RE_TRANS_TIMES_0                   = 0x00, /*!< re-transmission 0 times */
  CAN_RE_TRANS_TIMES_1                   = 0x01, /*!< re-transmission 1 times */
  CAN_RE_TRANS_TIMES_2                   = 0x02, /*!< re-transmission 2 times */
  CAN_RE_TRANS_TIMES_3                   = 0x03, /*!< re-transmission 3 times */
  CAN_RE_TRANS_TIMES_4                   = 0x04, /*!< re-transmission 4 times */
  CAN_RE_TRANS_TIMES_5                   = 0x05, /*!< re-transmission 5 times */
  CAN_RE_TRANS_TIMES_6                   = 0x06, /*!< re-transmission 6 times */
  CAN_RE_TRANS_TIMES_UNLIMIT             = 0x07  /*!< re-transmission unlimited times */
} can_retransmission_times_type;

/**
  * @brief  can re-arbitration times type
  */
typedef enum
{
  CAN_RE_ARBI_TIMES_0                    = 0x00, /*!< re-arbitration 0 times */
  CAN_RE_ARBI_TIMES_1                    = 0x01, /*!< re-arbitration 1 times */
  CAN_RE_ARBI_TIMES_2                    = 0x02, /*!< re-arbitration 2 times */
  CAN_RE_ARBI_TIMES_3                    = 0x03, /*!< re-arbitration 3 times */
  CAN_RE_ARBI_TIMES_4                    = 0x04, /*!< re-arbitration 4 times */
  CAN_RE_ARBI_TIMES_5                    = 0x05, /*!< re-arbitration 5 times */
  CAN_RE_ARBI_TIMES_6                    = 0x06, /*!< re-arbitration 6 times */
  CAN_RE_ARBI_TIMES_UNLIMIT              = 0x07  /*!< re-arbitration unlimited times */
} can_rearbitration_times_type;

/**
  * @brief  can mode type
  */
typedef enum
{
  CAN_MODE_COMMUNICATE                   = 0x00, /*!< normal communication mode */
  CAN_MODE_EXT_LOOPBACK                  = 0x01, /*!< external loopback mode */
  CAN_MODE_EXT_LOOPBACK_ACK              = 0x02, /*!< external loopback mode with self-ack */
  CAN_MODE_INT_LOOPBACK                  = 0x03, /*!< internal loopback mode */
  CAN_MODE_LISTENONLY                    = 0x04, /*!< listen-only mode */
  CAN_MODE_LISTENONLY_EXT                = 0x05, /*!< listen-only combined with external loopback mode */
  CAN_MODE_LISTENONLY_EXT_ACK            = 0x06  /*!< listen-only combined with external loopback mode with self-ack */
} can_mode_type;

/**
  * @brief  can transmit state encoding type
  */
typedef enum
{
  CAN_TSTAT_IDLE                         = 0x00, /*!< no transmission in progress */
  CAN_TSTAT_ONGOING                      = 0x01, /*!< transmission active without any issues */
  CAN_TSTAT_LOST_ARBITRATION             = 0x02, /*!< arbitration lost. re-arbitration may take place with respect to REALIM. */
  CAN_TSTAT_TRANSMITTED                  = 0x03, /*!< transmission successfully completed */
  CAN_TSTAT_ABORTED                      = 0x04, /*!< transmission aborted */
  CAN_TSTAT_DISTURBED                    = 0x05, /*!< transmission error. retransmission may take place with respect to RETLIM. */
  CAN_TSTAT_REJECTED                     = 0x06  /*!< misconfiguration of the frame format in the LLC frame. */
} can_tstat_encoding_type;

/**
  * @brief can filter type
  */
typedef enum
{
  CAN_FILTER_NUM_0                       = 0x00, /*!< can filter number 0 */
  CAN_FILTER_NUM_1                       = 0x01, /*!< can filter number 1 */
  CAN_FILTER_NUM_2                       = 0x02, /*!< can filter number 2 */
  CAN_FILTER_NUM_3                       = 0x03, /*!< can filter number 3 */
  CAN_FILTER_NUM_4                       = 0x04, /*!< can filter number 4 */
  CAN_FILTER_NUM_5                       = 0x05, /*!< can filter number 5 */
  CAN_FILTER_NUM_6                       = 0x06, /*!< can filter number 6 */
  CAN_FILTER_NUM_7                       = 0x07, /*!< can filter number 7 */
  CAN_FILTER_NUM_8                       = 0x08, /*!< can filter number 8 */
  CAN_FILTER_NUM_9                       = 0x09, /*!< can filter number 9 */
  CAN_FILTER_NUM_10                      = 0x0A, /*!< can filter number 10 */
  CAN_FILTER_NUM_11                      = 0x0B, /*!< can filter number 11 */
  CAN_FILTER_NUM_12                      = 0x0C, /*!< can filter number 12 */
  CAN_FILTER_NUM_13                      = 0x0D, /*!< can filter number 13 */
  CAN_FILTER_NUM_14                      = 0x0E, /*!< can filter number 14 */
  CAN_FILTER_NUM_15                      = 0x0F, /*!< can filter number 15 */
} can_filter_type;

/**
  * @brief can ttcan txbuf type
  */
typedef enum
{
  CAN_TTCAN_TXBUF_NUM_0                  = 0x00, /*!< can ttcan txbuf number 0 */
  CAN_TTCAN_TXBUF_NUM_1                  = 0x01, /*!< can ttcan txbuf number 1 */
  CAN_TTCAN_TXBUF_NUM_2                  = 0x02, /*!< can ttcan txbuf number 2 */
  CAN_TTCAN_TXBUF_NUM_3                  = 0x03, /*!< can ttcan txbuf number 3 */
} can_ttcan_txbuf_type;

/**
  * @brief  can transmit status structure definition
  */
typedef struct
{
  uint8_t                                current_handle; /*!< specifies current handle for frame identification. */

  can_tstat_encoding_type                current_tstat;  /*!< specifies current transmission status of transmit frame.*/

